In [1]:
import pandas as pd
apples=pd.Series([3,2,0,1])
oranges =pd.Series([3,2,0,1])
#print(apples,oranges)
data = {"apples":apples,"oranges":oranges}
fruits_df=pd.DataFrame(data)
print(fruits_df)

   apples  oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [2]:
data={"State":['Ohio','Ohio','Ohio','Navenda','Navenda','Navenda'],'year':[2000,2001,2002,2003,2001,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
state_pop_df=pd.DataFrame(data,index=['1st','2nd','3rd','4th','5th','6th'])
print(state_pop_df)

       State  year  pop
1st     Ohio  2000  1.5
2nd     Ohio  2001  1.7
3rd     Ohio  2002  3.6
4th  Navenda  2003  2.4
5th  Navenda  2001  2.9
6th  Navenda  2003  3.2

In [3]:
state_pop_df=pd.DataFrame(data,columns=['year','State','pop'])
state_pop_df.head()

   year    State  pop
0  2000     Ohio  1.5
1  2001     Ohio  1.7
2  2002     Ohio  3.6
3  2003  Navenda  2.4
4  2001  Navenda  2.9

In [4]:
frame2=pd.DataFrame(data,columns=['year','State','pop','debt'],
                    index=['one','two','three','four','five','six'])
frame2.head()

       year    State  pop debt
one    2000     Ohio  1.5  NaN
two    2001     Ohio  1.7  NaN
three  2002     Ohio  3.6  NaN
four   2003  Navenda  2.4  NaN
five   2001  Navenda  2.9  NaN

In [5]:
frame2.columns

Index(['year', 'State', 'pop', 'debt'], dtype='object')

In [6]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# A column in a DataFrame can be retrieved as a Series either by dict_like notation or by attribute

In [7]:
#print(data)
#data['State']
# this is dictionary like notation to acces or extract
#data frame column data
frame2['year']

one      2000
two      2001
three    2002
four     2003
five     2001
six      2003
Name: year, dtype: int64

In [8]:
# there is another method,attribute style(frame2.state) of accessing
#dataframe
frame2.State

one         Ohio
two         Ohio
three       Ohio
four     Navenda
five     Navenda
six      Navenda
Name: State, dtype: object

In [9]:
# for data extracting another method by using (.loc function[index])
frame2.loc['one']

year     2000
State    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [10]:
# important cell for code review
import numpy as np
import pandas as pd
data={"State":['Ohio','Ohio','Ohio','Navenda','Navenda','Navenda'],'year':[2000,2001,2002,2003,2001,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame2=pd.DataFrame(data,index=['1st','2nd','3rd','4th','5th','6th'])
ln=len(frame2)
rng=np.arange(ln)
frame2['debt']=rng
frame2

       State  year  pop  debt
1st     Ohio  2000  1.5     0
2nd     Ohio  2001  1.7     1
3rd     Ohio  2002  3.6     2
4th  Navenda  2003  2.4     3
5th  Navenda  2001  2.9     4
6th  Navenda  2003  3.2     5

# point to remember,inserting new values ,needs to be match in length of dataframr (numbers of element)

In [11]:
val=pd.Series([-1.2,-1.5,-1.7,-1.2,-1.5,-1.7,2.2],index=['one','two','three','four','five','six','seven'])
frame2['debt']=val
frame2

       State  year  pop  debt
1st     Ohio  2000  1.5   NaN
2nd     Ohio  2001  1.7   NaN
3rd     Ohio  2002  3.6   NaN
4th  Navenda  2003  2.4   NaN
5th  Navenda  2001  2.9   NaN
6th  Navenda  2003  3.2   NaN

# columns can be modified bu assignment.For Example,the empty "debt column could be assigned a scalar value or an array of values."

In [12]:
frame2['debt']=16.5
frame2.head()

       State  year  pop  debt
1st     Ohio  2000  1.5  16.5
2nd     Ohio  2001  1.7  16.5
3rd     Ohio  2002  3.6  16.5
4th  Navenda  2003  2.4  16.5
5th  Navenda  2001  2.9  16.5

In [16]:
# important cell for code review
import numpy as np
import pandas as pd
data={"State":['Ohio','Ohio','Ohio','Navenda','Navenda','Navenda'],'year':[2000,2001,2002,2003,2001,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame2=pd.DataFrame(data,index=['1st','2nd','3rd','4th','5th','6th'])
ln=len(frame2)
print(ln)
rng=np.arange(ln)
print(rng)
frame2['debt']=rng
print(frame2)

6
[0 1 2 3 4 5]
       State  year  pop  debt
1st     Ohio  2000  1.5     0
2nd     Ohio  2001  1.7     1
3rd     Ohio  2002  3.6     2
4th  Navenda  2003  2.4     3
5th  Navenda  2001  2.9     4
6th  Navenda  2003  3.2     5

In [18]:
type(frame2)

pandas.core.frame.DataFrame

# function application and mapping dataframe

In [22]:
frame = frame= pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['ulta','ohio','texas','oregeon'])
print(frame)
print(np.abs(frame))

                b         d         e
ulta     0.162929  2.084003  1.262677
ohio    -0.858120 -1.866000  1.101603
texas    1.633786 -1.014658 -0.882151
oregeon  0.972322 -0.795136 -0.191259
                b         d         e
ulta     0.162929  2.084003  1.262677
ohio     0.858120  1.866000  1.101603
texas    1.633786  1.014658  0.882151
oregeon  0.972322  0.795136  0.191259